Джира/src/InformationRegisters/Центр_ПользовательскиеНастройки/Центр_ПользовательскиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ПользовательскиеНастройки</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.Центр_ВидыПользовательскихНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНастройки</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Центр_ВидыПользовательскихНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/CommonModules/Центр_УведомленияПользователей/Module.bsl
#Область ПрограммныйИнтерфейс
//Отправляет уведомление с указанными параметрами выбранному пользователю
// Параметры:
//		Пользователь - СправочникСсылка.Пользователи,
//		ТекстУведомления - Строка,
//		СрокНапоминания - Дата,
//		ВремяУведомления - Дата,
//		СпособУстановкиВремениНапоминания - ПеречислениеСсылка.СпособыУстановкиВремениНапоминания,
//		ИнтервалВремениНапоминания - Число,
//		ПредметУведомления - ДокументСсылка.Центр_Задача,
//		Идентификатор - Строка
Процедура ОтправитьУведомлениеПользователю(Пользователь, ТекстУведомления, СрокНапоминания, ВремяУведомления, СпособУстановкиВремениНапоминания, ИнтервалВремениНапоминания = 600, ПредметУведомления = Неопределено, Идентификатор = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Центр_ПользовательскиеНастройки.Значение,
		|	Центр_ПользовательскиеНастройки.ВидНастройки
		|ИЗ
		|	РегистрСведений.Центр_ПользовательскиеНастройки КАК Центр_ПользовательскиеНастройки
		|ГДЕ
		|	Центр_ПользовательскиеНастройки.Пользователь = &Пользователь
		|	И Центр_ПользовательскиеНастройки.ВидНастройки В
		|	(ЗНАЧЕНИЕ(ПланВидовХарактеристик.Центр_ВидыПользовательскихНастроек.База),
		|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.Центр_ВидыПользовательскихНастроек.ЭлектроннаяПочта),
		|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.Центр_ВидыПользовательскихНастроек.Битрикс),
		|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.Центр_ВидыПользовательскихНастроек.Телеграм))";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидНастройки = ПредопределенноеЗначение("ПланВидовХарактеристик.Центр_ВидыПользовательскихНастроек.ЭлектроннаяПочта") И Выборка.Значение Тогда
			
		КонецЕсли;
		
		Если Выборка.ВидНастройки = ПредопределенноеЗначение("ПланВидовХарактеристик.Центр_ВидыПользовательскихНастроек.Телеграм") И Выборка.Значение Тогда
			
		КонецЕсли;
		
		Если Выборка.ВидНастройки = ПредопределенноеЗначение("ПланВидовХарактеристик.Центр_ВидыПользовательскихНастроек.Битрикс") И Выборка.Значение Тогда
			
		КонецЕсли;
		
		Если Выборка.ВидНастройки = ПредопределенноеЗначение("ПланВидовХарактеристик.Центр_ВидыПользовательскихНастроек.База") И Выборка.Значение Тогда
			ПараметрыНапоминания = Новый Структура();
			
			ПараметрыНапоминания.Вставить("Пользователь", Пользователь);
			ПараметрыНапоминания.Вставить("Описание", ТекстУведомления);
			ПараметрыНапоминания.Вставить("ВремяСобытия", ВремяУведомления);
			ПараметрыНапоминания.Вставить("СрокНапоминания", СрокНапоминания);
			ПараметрыНапоминания.Вставить("Источник", ПредметУведомления);
			ПараметрыНапоминания.Вставить("СпособУстановкиВремениНапоминания", СпособУстановкиВремениНапоминания);
			ПараметрыНапоминания.Вставить("ИнтервалВремениНапоминания", ИнтервалВремениНапоминания);
			ПараметрыНапоминания.Вставить("Идентификатор", Идентификатор);
			
			НапоминанияПользователяСлужебный.ПодключитьНапоминание(ПараметрыНапоминания, Ложь, Ложь);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
